RuanJG/stm32App/source/app/app_trex_v2.c
//packget body : result error value
#define USER_RES_CURRENT_FALSE_FLAG 1
#define USER_RES_VOICE_FALSE_FLAG 2
#define USER_RES_ERROR_FLAG 4

//work_mode value
#define USER_MODE_ONLINE 1
#define USER_MODE_OFFLINE 2
#define USER_MODE_SLAVER 3 


Uart_t *userUart=NULL;
protocol_t encoder;
protocol_t decoder;
volatile unsigned char userStation_mode;


#define ENABLE_REPORT_RESEND 0
unsigned char report_buffer[11];
volatile char report_listen_tag;
systick_time_t report_listen_timer;





void userStation_init()
{
	userUart = PC_UART;
	userStation_mode = USER_MODE_ONLINE;
	protocol_init( &encoder );
	protocol_init( &decoder );
	
	report_listen_tag = 0;
}

int userStation_send( unsigned char *data , int len)
{
	if( 1 == protocol_encode( &encoder, data, len ) ){
		Uart_Put_Sync( userUart , encoder.data, encoder.len );
		//USB_TxWrite( encoder.data, encoder.len );
		return 1;
	}else{
		return 0;
	}
}


unsigned char buffer[ 256 ];
void userStation_log( char * str ){
	
	if( strlen( str ) > sizeof(buffer) )
		return;
	
	buffer[0] = MACHINE_NO|USER_LOG_TAG;
	memcpy( &buffer[1], str , strlen(str) );
	
	if( 0 == userStation_send( buffer, strlen(str)+1 ) ){
		_LOG("userStation_log: encode false");
	}
	
}



void userStation_report_resend_start()
{
	report_listen_tag = 1;
	systick_init_timer( &report_listen_timer , 200);
}



void userStation_report(int db, float current, int work_counter, int error)
{
	//tag[0]+db[0]db[1]db[2]db[3]+current[....]+work_current[0]+error[0]  ; work_counter is the count of the records
	
	
	
	report_buffer[0]= MACHINE_NO|USER_DATA_TAG;
	memcpy( &report_buffer[1], (unsigned char*) &db, 4 ) ;
	memcpy( &report_buffer[5], (unsigned char*) &current , 4 ); 
	report_buffer[9]= work_counter;
	report_buffer[10] = error;
	

	if( 0 == userStation_send( report_buffer, sizeof(report_buffer) ) ){
		_LOG("userStation_report: send false\n");
		userStation_log("userStation_report: send false\n");
	}
	
	if( error != 0 || work_counter != 0 ){
		userStation_report_resend_start();
	}else{
		report_listen_tag = 0;
	}
	
	_LOG("report: db=%d, current=%f , count=%d, error=%d\n", db, current, work_counter ,error);
}




void userStation_send_config()
{
	unsigned char buffer[18];
	
	buffer[0]= MACHINE_NO|USER_CONFIG_TAG;
	buffer[1] = g_config.config_avaliable; // 1 available
	memcpy( &buffer[2], (unsigned char*) &g_config.current_max, 4 ) ;
	memcpy( &buffer[6], (unsigned char*) &g_config.current_min , 4 ); 
	memcpy( &buffer[10], (unsigned char*) &g_config.db_max, 4 ) ;
	memcpy( &buffer[14], (unsigned char*) &g_config.db_min , 4 ); 
	
	if( 0 == userStation_send( buffer, sizeof(buffer) ) ){
		_LOG("send config false\n");
		userStation_log("send config false\n");
	}
	
}



void userStation_handleMsg( unsigned char *data, int len)
{
	int dbmin,dbmax;
	float cmax,cmin;
	unsigned char buffer[32]={0};
	
	switch( data[0] ){
		case USER_CMD_CHMOD_TAG:
			if( len == 2 ){
				userStation_mode = data[1];
			}
			break;
			
		case USER_CMD_CURRENT_MAXMIN_TAG:
			if( len == 9 ){
				memcpy( (char*)&cmax, data+1, 4);
				memcpy( (char*)&cmin, data+5, 4);
				g_config.current_max = cmax;
				g_config.current_min = cmin;
				config_save();
				userStation_send_config();
				sprintf((char*)buffer,"current=[%fA,%fA]",g_config.current_min, g_config.current_max);
				userStation_log( (char*) buffer );
			}
			break;
		
		case USER_CMD_VOICE_MAXMIN_TAG:
			if( len == 9 ){
				memcpy( (char*)&dbmax, data+1, 4);
				memcpy( (char*)&dbmin, data+5, 4);
				g_config.db_max = dbmax;
				g_config.db_min = dbmin;
				config_save();
				userStation_send_config();
				sprintf((char*)buffer,"db=[%d,%d]",g_config.db_min, g_config.db_max);
				userStation_log( (char*) buffer );
			}
			break;
			
		case USER_CMD_GET_MAXMIN_TAG:
			userStation_send_config();
			break;
		
		case USER_ACK_TAG:
			if( report_listen_tag == 1 )
				report_listen_tag = 0;
			break;
			
		case USER_CMD_SET_SW_STATUS_TAG:
			if( len == 2 ){
				if( userStation_mode == USER_MODE_SLAVER ){
					sw_on_tag = data[1];
				}
			}
			break;
		default:
			break;
	}
}

void userStation_report_resend_event()
{
	if( ENABLE_REPORT_RESEND == 0 ) return;
	
	if( report_listen_tag == 0 ) return;
	
	if( systick_check_timer( &report_listen_timer ) ){
		if( 0 == userStation_send( report_buffer, sizeof(report_buffer) ) ){
			_LOG("userStation_report_resend_event: send false\n");
			userStation_log("userStation_report_resend_event: send false\n");
		}
	}
	
}

void userStation_listen_even()
{
	unsigned char buffer[8];
	unsigned char i, len;
	
	len = Uart_Get( userUart, buffer, 8 );
	//len = USB_RxRead ( buffer, 8 );
	for( i=0 ; i<len; i++ ){
		if( 1 == protocol_parse( &decoder, buffer[i] ) ){
			userStation_handleMsg( decoder.data, decoder.len );
		}
	}
	
	userStation_report_resend_event();
}





#define USING_MINIMETER 1
#define USING_VICTORMETER 0



#if USING_MINIMETER

/*
出厂时仪表波特率是9600,可以自行设置
每台设备出厂时通迅地址都是0x00

A:单次读取设备数据(设备接收到此命令后,向主机发送1次数据后回到等待状态)
0x88+0xAE+设备地址+0x11  实例88AE0011

B:连续读取设备数据(设备接收到此命令后,将以每秒6组的速度向主机连续发送数据)
0x88+0xAE+设备地址+0x21

C:停止设备输出数据,此命令不管当前工作的是哪一台设备,都将停止输出
0x88+0xAE+任意字节+0x01

D:设备返回给主机(PC)数据格式
0xFA+0xFB+设备地址+数据字节0+数据字节1+数据字节2+数据字节3+校验字节
数据由4个字节组成(注意:靠左的是低字节和习惯上是反的),接收后需要转换成浮点数才能对应设备显示数据.校验字节是4个数据字节相加的结果(进位舍去)
*/
typedef struct miniMeterCoder {
	unsigned char packet[8];
	unsigned char index;
	unsigned char addr;
	float 				value;
}miniMeterCoder_t;

void miniMeterCoder_init(miniMeterCoder_t * coder)
{
	int i;
	for( i=0; i< sizeof(coder->packet); i++)
		coder->packet[i]=0;
	coder->index = 0;
	coder->addr = 0;
}

int miniMeterCoder_prase( miniMeterCoder_t * coder, unsigned char data )
{
	unsigned char crc;
	unsigned char *value ;
	
	if( coder->index == 0  && data != 0xFA ) return 0;
	if( coder->index == 1 && data != 0xFB ) { coder->index = 0; return 0; }
	if( coder->index == 2  && data != coder->addr ) { coder->index = 0; return 0; }
	
	coder->packet[ coder->index++ ] = data;
	
	if( coder->index < sizeof(coder->packet) ) return 0;
	
	//check crc
	coder->index = 0;
	crc = coder->packet[3]+coder->packet[4]+coder->packet[5]+coder->packet[6];
	if( crc == coder->packet[7] ) {
		//coder->value = *((float*) &coder->packet[3] );
		value = (unsigned char *)&coder->value;
		value[0] = coder->packet[6];
		value[1] = coder->packet[5];
		value[2] = coder->packet[4];
		value[3] = coder->packet[3];
		return 1;
	}
	return 0;
}



