RuanJG/stm32App/source/app/app_trex_v2.c
	tag = USER_START_TAG;	
	userStation_send( &tag , 1 );
	userStation_send_config();
	
	//set led status
	led_on(LED_STATUS_ID);
	led_off( LED_ERROR_ID );
	led_off(LED_PASS_ID);
	led_off(LED_VOICE_ERROR_ID);
	led_off(LED_CURRENT_ERROR_ID);
	

	
	#if USING_VICTORMETER 
	if( 0 == victor8165_check( "FUNC1?\n", "ADC\n") ){
		_LOG("victor8165_getCurrent: need to init\n");
		victor8165_inited = 0;
		victor8165_init();
	}
	#endif
}

void server_stop()
{
	int i,error;
	float current;
	int db;
	
	if( work_counter > 0 ){
		db = 0;
		for( i=0; i< work_counter; i++){
			current+=current_array[i];
			db+=db_array[i];
		}
		db = db/work_counter;
		current = current/work_counter;
		
	}
	
	
	//TODO set led status
	if( work_counter> 0 &&  current < g_config.current_max  && current > g_config.current_min && db < g_config.db_max){
		led_on(LED_PASS_ID);
		led_off(LED_VOICE_ERROR_ID);
		led_off(LED_CURRENT_ERROR_ID);
		led_off(LED_ERROR_ID);
		userStation_report( db, current , work_counter, 0);
	}else {
		led_off(LED_PASS_ID);
		if( work_counter > 0 ){
			error = 0;
			if( current >= g_config.current_max || current <= g_config.current_min ){
				error |= USER_RES_CURRENT_FALSE_FLAG;
				led_on(LED_CURRENT_ERROR_ID);
			}
			if( db >= g_config.db_max ){
				error |= USER_RES_VOICE_FALSE_FLAG;
				led_on(LED_VOICE_ERROR_ID);
			}
			userStation_report( db, current , work_counter, error);
		}else{
			led_on(LED_ERROR_ID);
			userStation_report( 0, 0 , work_counter, USER_RES_ERROR_FLAG);
		}
	}
	
	#if USING_MINIMETER
	miniMeter_stop();
	#endif
	
	//update status
	led_off(LED_STATUS_ID);
}

void server_runtime()
{	
	int res;
	
	if( 0 == systick_check_timer( &work_timer ) )
		return ;
	
	if( server_collect_over == 1 ) 
		return ;
	
	//has collected enought records
	if( work_counter >= CALI_DATA_COUNT || 1 == systick_check_timer( &collect_1s_timer ) ){
		server_collect_over = 1;
		server_stop();
		server_status = 2;
		return ;
	}
	
	
	#if USING_MINIMETER
	if( 0 == miniMeter_start() ){
		_LOG(" miniMeter start error \n");
		userStation_log(" miniMeter start error \n");
	}
	#endif
	

	
	
	res = 1;
	
	//get current by uart
	if( 0 == service_getCurrent( &current_array[ work_counter ] ) ){
		//_LOG("server_runtime: get current false\n");
		userStation_log("read current false");
		res = 0;
	}
	
	//get db
	db_array[ work_counter ] = get_voice_db();
	if( db_array[work_counter] < 0 ){
		_LOG("error: read adc \n");
		userStation_log("read adc false");
		res = 0;
	}
	if( db_array[work_counter] < g_config.db_min ){
		_LOG("error: read Noise too low , check connection \n");
		userStation_log("error: Noise too low");
		res = 0;
	}


	//update counter
	if( res == 1 ){
		userStation_report( db_array[ work_counter ], current_array[ work_counter ], 0, 0 ); 
		work_counter++;
	}
	
	//will run this func after 100ms
	systick_init_timer( &work_timer, 20);
}

void server_event()
{
	if( sw_on_tag == 1 ){
		
		if( server_status == 0 ){
			server_start();
			server_status = 1;
		}
		if( server_status == 1 )
			server_runtime();
		
	}else{
		
		if( server_status == 1 ){
			server_stop();
			server_status = 0;
		}else if( server_status == 2){
			// has call server_stop , as collection has finish earlier
			server_status = 0;
		}else{
			server_status = 0;
		}
		
	}	
}



systick_time_t heart_led_timer;

void heart_led_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_13;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	systick_init_timer(&heart_led_timer, 1000);
	
}

void heart_led_even()
{
	static BitAction led = Bit_RESET;
	static unsigned char tag = 0;
	char buffer[16];
	
	if( systick_check_timer( &heart_led_timer ) ){
		GPIO_WriteBit( GPIOC, GPIO_Pin_13 , led);
		led = led==Bit_RESET ? Bit_SET: Bit_RESET ;
		//Uart_Put(PC_UART,"test",4);
		//get_voice_db();
		sprintf(buffer,"%d=sw:%d,ss:%d",tag++,sw_on_tag,server_status);
		userStation_log(buffer);
		tag %= 10;
	}		
}




systick_time_t user_station_loop_test_timer;

void user_station_loop_test_init()
{
	systick_init_timer(&user_station_loop_test_timer, 50);
	
}
volatile int testcount=0;
void user_station_loop_test_even()
{
	unsigned char tag;
	
	if( report_listen_tag == 0 &&  systick_check_timer( &user_station_loop_test_timer ) ){
		if( testcount >= 50 ){
			userStation_report( 40, 0.5 , 50, 0 ); 
			testcount = 0;
		}else if( testcount == 0 ){
			tag = USER_START_TAG;	
			userStation_send( &tag , 1 );
			systick_delay_us(500000);
			testcount ++;	
		}else{
			userStation_report( 40, 0.5 , 0, 0 );
			testcount ++;			
		}
	}		
}


void cmd_even()
{
	unsigned char buffer[8];
	unsigned char i, len;
	
	len = USB_RxRead( buffer, 8 );
	
	if( len == 0 ) return;
		if( buffer[0] == '1' ){
			sw_on_tag = 1;
		}else if( buffer[0] == '0' ){
			sw_on_tag = 0;
		}
}





void app_init()
{
	Uart_init();

#if BOARD_HAS_IAP
	#if IAP_PORT_USB 
	iap_init_in_usb();
	#endif
	#if IAP_PORT_CAN1
	iap_init_in_can1();
	#endif
	#if  IAP_PORT_UART
	iap_init_in_uart( IAP_UART );
	#endif
#endif

	//console_init( CONSOLE_UART_TYPE ,CONSOLE_UART );
	console_init( CONSOLE_USB_TYPE ,NULL );
	

	ADC_Configuration ();
	led_pin_config();
	heart_led_init();
	switch_det_config();
	userStation_init();
	server_init();
	config_init();
	//user_station_loop_test_init();
	//systick_delay_us(1000000);
	//miniMeter_start();

}





void app_event()
{
	#if 1
	if( userStation_mode != USER_MODE_SLAVER)
		switch_det_event();
	server_event();
	userStation_listen_even();
	heart_led_even();
	//miniMeter_test_even();
	//user_station_loop_test_even();
	//cmd_even();
	#endif
}

#endif